fio = input("Введите ФИО исследователя: ")
date = input("Введите дату исследования: ")
exp = input("Введите название эксперимента: ")
res = input("Введите вывод: ")
with open("journal.txt", "w", encoding="utf-8") as card:
   card.write(f"+----------------------------------------------------------+\n|             Электронный лабораторный журнал              |\n+----------------------------------------------------------+\n| ФИО исследователя:      \t{fio} |\n| Дата:                                     \t{date} |\n| Эксперимент:             {exp} |\n+----------------------------------------------------------+\n| Вывод:                 \t{res} |\n+----------------------------------------------------------+")
   print("Файл 'journal.txt' успешно сформирован!")